notes/shell-3.org
#+Title: Shell-3: loops, scripts
#+Author: Paul E. Johnson <pauljohn@ku.edu>
#+Date: <2016-11-13>
#+PROPERTY: header-args :tangle yes :exports both :results output 
#+INCLUDE: /home/pauljohn/GIT/github/org-macros/org-macros.setup

* Process lots of files

** Fairly common problem

1. Data collection generates 1000s of data files and each one must be
   processed separately.

2. Project generates 1000s of pdf files and we are required to look
   through a large random sample, one-by-one.

3. Vacation photos are saved in super high resolution and we need to
   convert each one to something smaller for Instagram.

* The shell offers a convenient "for" loop that can handle this.

#+BEGIN_EXAMPLE
for index ...items list here...
   do
      ...commands involving $index
done
#+END_EXAMPLE

*Syntax*:  

1. *for*: Lets the shell know something is coming.
2. An "index" variable is created, which is used to refer to each one
   of the things, one at a time
3. Keywords *do* and *done* are bookmarks for a sequence of shell statements.

** My Vacation Photo example.

When I went on vacation, I saved photos that were way too huge. There
is a handy free program named "convert" that can rescale images
however you like, but it wants one file at a time. The syntax for
that is

#+BEGIN_EXAMPLE
$ convert file.jpg -resize 1400x1050 -quality 85 file.new.jpg
#+END_EXAMPLE

To process a lot of files, it is necessary to take each file, create a
new name, and then run convert on each one. 

I want output that takes the old name *file.jpg* and creates
the new name *file-1400x1050.jpg*. This file name part of the
assignment creates a little detour on splitting the file name in two
pieces. There is a handy program called *basename* that I use
often. 

We can write this out in 2 ways

1. The "jam it all into 1 line method" uses semi-colon (;) for
   puncutation.

   #+BEGIN_EXAMPLE
   $ for fn in *.jpg; do base=`basename $fn .jpg`; convert $fn -resize 1400x1050 -quality 85 $base-1400x1050.jpg; done
   #+END_EXAMPLE

2. The patient shell approach. BASH knows you are not
done typing when you hit return, it waits (signalling ">" to you)

#+BEGIN_EXAMPLE
$ for fn in *.jpg
> do 
>   base=`basename $fn .jpg` 
>   convert $fn -resize 1400x1050 -quality 85 $base-1400x1050.jpg
> done
#+END_EXAMPLE

If you type that in, the shell will wait until you hit enter after
done to begin.

Tricky bits. 

1. The first "fn" has no dollar sign, but when it is accessed, "$fn" it
   does! Among programming languages, that is unusual. The variable is
   created with no dollar sign, but to access it we require the dollar
   sign.

2. The "do" statement applies to all of the lines that follow, until
   done. The one line method makes it appear as though it only applies
   to the first.


** North Pacific gyre data example

Recall in the north-pacific-gyre folder, there are several data files
to be processed.

#+BEGIN_SRC sh :session :results none :exports none :dir /home/pauljohn/GIT/github/ou_swc_files/Users/nelle/north-pacific-gyre/2012-07-03
rm -rf output
#+END_SRC

#+BEGIN_SRC sh :session :dir /home/pauljohn/GIT/github/ou_swc_files/Users/nelle/north-pacific-gyre/2012-07-03
ls N*.txt
#+END_SRC

#+RESULTS:
#+begin_example
NENE01729A.txt
NENE01729B.txt
NENE01736A.txt
NENE01751A.txt
NENE01751B.txt
NENE01812A.txt
NENE01843A.txt
NENE01843B.txt
NENE01971Z.txt
NENE01978A.txt
NENE01978B.txt
NENE02018B.txt
NENE02040A.txt
NENE02040B.txt
NENE02040Z.txt
NENE02043A.txt
NENE02043B.txt
#+end_example

*Our Assignment*: Run each txt files through a data processing script.

Recall the problems unearthed in data inspection

   1. One file too small
   2. The Z-ending files are not useful
 
The shell script "goostats" is used to process each file and
create a new data output file.


