notes/shell-3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-11-14 Mon 22:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Shell-3: loops, scripts</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Paul E. Johnson &lt;pauljohn@ku.edu&gt;" />
</head>
<body>
<div id="content">
<h1 class="title">Shell-3: loops, scripts</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org27415b9">1. Process lots of files</a>
<ul>
<li><a href="#orgcf33cf4">1.1. Fairly common problem</a></li>
</ul>
</li>
<li><a href="#org6e6a907">2. The shell offers a convenient "for" loop that can handle this.</a>
<ul>
<li><a href="#orga853bed">2.1. My Vacation Photo example.</a></li>
<li><a href="#org892a2de">2.2. North Pacific gyre data example</a></li>
<li><a href="#org09019aa">2.3. My opinion on where the output should go</a></li>
<li><a href="#orgcb852b6">2.4. goostats is a script included with the project.</a>
<ul>
<li><a href="#org61dc0d0">2.4.1. run goostats once</a></li>
<li><a href="#orgda72344">2.4.2. For loop: run <b>over and over</b></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf4ad9e2">3. Scripts and command line arguments</a>
<ul>
<li><a href="#org37b6145">3.1. The Big Picture</a>
<ul>
<li><a href="#org0efb287">3.1.1. Create the text file "dostats.sh".</a></li>
<li><a href="#org03e4c2b">3.1.2. Deal with the command line arguments</a></li>
</ul>
</li>
<li><a href="#org6ff5898">3.2. Command line arguments</a>
<ul>
<li><a href="#org7298431">3.2.1. Key Terms</a></li>
<li><a href="#org461e9bf">3.2.2. Lets make a little test case.</a></li>
</ul>
</li>
<li><a href="#orga0107f1">3.3. Detour on executable files and "bash" as a program.</a></li>
<li><a href="#org95f6a76">3.4. Detour about the hash-bang</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org27415b9" class="outline-2">
<h2 id="org27415b9"><span class="section-number-2">1</span> Process lots of files</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgcf33cf4" class="outline-3">
<h3 id="orgcf33cf4"><span class="section-number-3">1.1</span> Fairly common problem</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Data collection generates 1000s of data files and each one must be
processed separately.</li>

<li>Project generates 1000s of pdf files and we are required to look
through a large random sample, one-by-one.</li>

<li>Vacation photos are saved in super high resolution and we need to
convert each one to something smaller for Instagram.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org6e6a907" class="outline-2">
<h2 id="org6e6a907"><span class="section-number-2">2</span> The shell offers a convenient "for" loop that can handle this.</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
for index ...items list here...
   do
      ...commands involving $index
done
</pre>

<p>
<b>Syntax</b>:  
</p>

<ol class="org-ol">
<li><b>for</b>: Lets the shell know something is coming.</li>
<li>An "index" variable is created, which is used to refer to each one
of the things, one at a time</li>
<li>Keywords <b>do</b> and <b>done</b> are bookmarks for a sequence of shell statements.</li>
</ol>
</div>

<div id="outline-container-orga853bed" class="outline-3">
<h3 id="orga853bed"><span class="section-number-3">2.1</span> My Vacation Photo example.</h3>
<div class="outline-text-3" id="text-2-1">
<p>
When I went on vacation, I saved photos that were way too huge. There
is a handy free program named "convert" that can rescale images
however you like, but it wants one file at a time. The syntax for
that is
</p>

<pre class="example">
$ convert file.jpg -resize 1400x1050 -quality 85 file.new.jpg
</pre>

<p>
To process a lot of files, it is necessary to take each file, create a
new name, and then run convert on each one. 
</p>

<p>
I want output that takes the old name <b>file.jpg</b> and creates
the new name <b>file-1400x1050.jpg</b>. This file name part of the
assignment creates a little detour on splitting the file name in two
pieces. There is a handy program called <b>basename</b> that I use
often. 
</p>

<p>
We can write this out in 2 ways
</p>

<ol class="org-ol">
<li><p>
The "jam it all into 1 line method" uses semi-colon (;) for
puncutation.
</p>

<pre class="example">
$ for fn in *.jpg; do base=`basename $fn .jpg`; convert $fn -resize 1400x1050 -quality 85 $base-1400x1050.jpg; done
</pre></li>

<li>The patient shell approach. BASH knows you are not</li>
</ol>
<p>
done typing when you hit return, it waits (signalling "&gt;" to you)
</p>

<pre class="example">
$ for fn in *.jpg
&gt; do 
&gt;   base=`basename $fn .jpg` 
&gt;   convert $fn -resize 1400x1050 -quality 85 $base-1400x1050.jpg
&gt; done
</pre>

<p>
If you type that in, the shell will wait until you hit enter after
done to begin.
</p>

<p>
Tricky bits. 
</p>

<ol class="org-ol">
<li>The first "fn" has no dollar sign, but when it is accessed, "$fn" it
does! Among programming languages, that is unusual. The variable is
created with no dollar sign, but to access it we require the dollar
sign.</li>

<li>The "do" statement applies to all of the lines that follow, until
done. The one line method makes it appear as though it only applies
to the first.</li>
</ol>
</div>
</div>


<div id="outline-container-org892a2de" class="outline-3">
<h3 id="org892a2de"><span class="section-number-3">2.2</span> North Pacific gyre data example</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Recall in the north-pacific-gyre folder, there are several data files
to be processed.
</p>

<div class="org-src-container">
<pre class="src src-sh">ls N*.txt
</pre>
</div>

<pre class="example">
NENE01729A.txt
NENE01729B.txt
NENE01736A.txt
NENE01751A.txt
NENE01751B.txt
NENE01812A.txt
NENE01843A.txt
NENE01843B.txt
NENE01971Z.txt
NENE01978A.txt
NENE01978B.txt
NENE02018B.txt
NENE02040A.txt
NENE02040B.txt
NENE02040Z.txt
NENE02043A.txt
NENE02043B.txt
</pre>

<p>
<b>Our Assignment</b>: Run each txt files through a data processing script.
</p>

<p>
Recall the problems unearthed in data inspection
</p>

<ol class="org-ol">
<li>One file too small</li>
<li>The Z-ending files are not useful</li>
</ol>

<p>
The shell script "goostats" is used to process each file and
create a new data output file.
</p>
</div>
</div>
