notes/shell-3.org
** My opinion on where the output should go

- I strongly prefer to keep the output in a separate output directory.
- And I would almost certainly put the output directory outside the
  current working directory.

#+BEGIN_SRC sh :session :dir /home/pauljohn/GIT/github/ou_swc_files/Users/nelle/north-pacific-gyre/2012-07-03
mkdir ../output
#+END_SRC


Why do I like that? No danger of disrupting original data.

In fact, I'd make the original data read only like so

#+BEGIN_EXAMPLE
chmod -w N*.txt
#+END_EXAMPLE

** goostats is a script included with the project. 

Our assignment is to run each file through goostats. 

*** run goostats once

   * The correct way to process just one file, including 2 parameters
     that professor said we needed.: 

#+BEGIN_SRC sh :session :dir /home/pauljohn/GIT/github/ou_swc_files/Users/nelle/north-pacific-gyre/2012-07-03
bash goostats  -J 100 -r NENE01729A.txt ../output/NENE01729A-stats.txt
#+END_SRC

   * Did it work?

#+BEGIN_SRC sh :session :dir /home/pauljohn/GIT/github/ou_swc_files/Users/nelle/north-pacific-gyre/2012-07-03
ls ../output
#+END_SRC

   * Lets remove that output folder before we try again

#+BEGIN_SRC sh :session :dir /home/pauljohn/GIT/github/ou_swc_files/Users/nelle/north-pacific-gyre/2012-07-03
rm -rf  "../output"
#+END_SRC


*** For loop: run *over and over*

#+BEGIN_EXAMPLE
$ mkdir ../output
$ for fn in *[AB].txt
>    do
>        bash goostats -J 100 -r "$fn" "../output/stats-$fn"
> done
#+END_EXAMPLE





* Scripts and command line arguments

** The Big Picture

1. Test commands that work in the command line
2. Put those lines into a file
3. Work out the command line arguments problem
4. Consider adding "hash-bang" in line 1


*** Create the text file "dostats.sh".

It looks nicer to write it like this:


#+BEGIN_EXAMPLE
for fn in *[AB].txt
do
    echo $fn
    bash goostats -J 100 -r "$fn" "output/stats-$fn" 
done
#+END_EXAMPLE


But it is allowed to use semi-colon to jamb it into one line

#+BEGIN_EXAMPLE
for fn in *[AB].txt; do  echo $fn;  bash goostats -J 100 -r "$fn" "../output/stats-$fn"; done
#+END_EXAMPLE

*** Deal with the command line arguments

Now we have the file names hard coded in the script.

Here we use the shortcut "$@" to grab all command line arguments

#+BEGIN_SRC sh :session :dir /home/pauljohn/GIT/github/ou_swc_files/Users/nelle/north-pacific-gyre/2012-07-03
### rm -rf ../output
mkdir ../output
for fn in "$@"
do
    echo $fn
    bash goostats -J 100 -r "$fn" "../output/stats-$fn" 
done
#+END_SRC

#+RESULTS:



** Command line arguments

The shell command line arguments can be handled in many ways. The
simple way simply used arguments by their position in the command
line. This is not the best way, since there is no error checking
on the inputs. However, it is commonly used in small projects.

*** Key Terms

Inside a shell script, these are the simple ways to access command
line arguments.

1. The dollar sign picks individual arguments

   - $n means the n'th argument.

   - $1 means "the first command line argument"
   - $2 means "the second command line argument"

2. $@ collects up all of the command line arguments.

More rigorous ways exist to name and check command
line arguments. Don't get too committed to the simple
$1 $2 notation.

*** Lets make a little test case.  

*mytest.sh*

#+BEGIN_EXAMPLE
echo "$1"
echo "$2"
echo "OMG here is $1 again"
echo "I'll splat them together $1$2"
#+END_EXAMPLE

I often forget the double-quotes on the arguments.

Test that in the command line

1. No quotes

#+BEGIN_EXAMPLE
sh mytest.sh hellopaul hellobill
#+END_EXAMPLE

2. Watch what goes wrong if you have a space in a argument name "hello paul"

#+BEGIN_EXAMPLE
sh mytest.sh hello paul hellobill
#+END_EXAMPLE

3. Need to quote the argument to keep the pieces together

#+BEGIN_EXAMPLE
sh mytest.sh "hello paul" hellobill
#+END_EXAMPLE

