notes/shell-3.html


<div id="outline-container-org09019aa" class="outline-3">
<h3 id="org09019aa"><span class="section-number-3">2.3</span> My opinion on where the output should go</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>I strongly prefer to keep the output in a separate output directory.</li>
<li>And I would almost certainly put the output directory outside the
current working directory.</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh">mkdir ../output
</pre>
</div>

<p>
Why do I like that? No danger of disrupting original data.
</p>

<p>
In fact, I'd make the original data read only like so
</p>

<pre class="example">
chmod -w N*.txt
</pre>
</div>
</div>

<div id="outline-container-orgcb852b6" class="outline-3">
<h3 id="orgcb852b6"><span class="section-number-3">2.4</span> goostats is a script included with the project.</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Our assignment is to run each file through goostats. 
</p>
</div>

<div id="outline-container-org61dc0d0" class="outline-4">
<h4 id="org61dc0d0"><span class="section-number-4">2.4.1</span> run goostats once</h4>
<div class="outline-text-4" id="text-2-4-1">
<ul class="org-ul">
<li>The correct way to process just one file, including 2 parameters
that professor said we needed.:</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh">bash goostats  -J 100 -r NENE01729A.txt ../output/NENE01729A-stats.txt
</pre>
</div>

<ul class="org-ul">
<li>Did it work?</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh">ls ../output
</pre>
</div>

<pre class="example">
NENE01729A-stats.txt
</pre>

<ul class="org-ul">
<li>Lets remove that output folder before we try again</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh">rm -rf  <span style="color: #8b7355;">"../output"</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgda72344" class="outline-4">
<h4 id="orgda72344"><span class="section-number-4">2.4.2</span> For loop: run <b>over and over</b></h4>
<div class="outline-text-4" id="text-2-4-2">
<pre class="example">
$ mkdir ../output
$ for fn in *[AB].txt
&gt;    do
&gt;        bash goostats -J 100 -r "$fn" "../output/stats-$fn"
&gt; done
</pre>
</div>
</div>
</div>
</div>





<div id="outline-container-orgf4ad9e2" class="outline-2">
<h2 id="orgf4ad9e2"><span class="section-number-2">3</span> Scripts and command line arguments</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org37b6145" class="outline-3">
<h3 id="org37b6145"><span class="section-number-3">3.1</span> The Big Picture</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>Test commands that work in the command line</li>
<li>Put those lines into a file</li>
<li>Work out the command line arguments problem</li>
<li>Consider adding "hash-bang" in line 1</li>
</ol>
</div>


<div id="outline-container-org0efb287" class="outline-4">
<h4 id="org0efb287"><span class="section-number-4">3.1.1</span> Create the text file "dostats.sh".</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
It looks nicer to write it like this:
</p>


<pre class="example">
for fn in *[AB].txt
do
    echo $fn
    bash goostats -J 100 -r "$fn" "output/stats-$fn" 
done
</pre>


<p>
But it is allowed to use semi-colon to jamb it into one line
</p>

<pre class="example">
for fn in *[AB].txt; do  echo $fn;  bash goostats -J 100 -r "$fn" "../output/stats-$fn"; done
</pre>
</div>
</div>

<div id="outline-container-org03e4c2b" class="outline-4">
<h4 id="org03e4c2b"><span class="section-number-4">3.1.2</span> Deal with the command line arguments</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Now we have the file names hard coded in the script.
</p>

<p>
Here we use the shortcut "$@" to grab all command line arguments
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #7f7f7f;">### </span><span style="color: #7f7f7f;">rm -rf ../output</span>
mkdir ../output
<span style="color: #1c86ee;">for</span> fn<span style="color: #1c86ee;"> in</span> <span style="color: #8b7355;">"$@"</span>
<span style="color: #1c86ee;">do</span>
    <span style="color: #cd6600;">echo</span> $<span style="color: #2e8b57;">fn</span>
    bash goostats -J 100 -r <span style="color: #8b7355;">"$fn"</span> <span style="color: #8b7355;">"../output/stats-$fn"</span> 
<span style="color: #1c86ee;">done</span>
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-org6ff5898" class="outline-3">
<h3 id="org6ff5898"><span class="section-number-3">3.2</span> Command line arguments</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The shell command line arguments can be handled in many ways. The
simple way simply used arguments by their position in the command
line. This is not the best way, since there is no error checking
on the inputs. However, it is commonly used in small projects.
</p>
</div>

<div id="outline-container-org7298431" class="outline-4">
<h4 id="org7298431"><span class="section-number-4">3.2.1</span> Key Terms</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Inside a shell script, these are the simple ways to access command
line arguments.
</p>

<ol class="org-ol">
<li>The dollar sign picks individual arguments

<ul class="org-ul">
<li>$n means the n'th argument.</li>

<li>$1 means "the first command line argument"</li>
<li>$2 means "the second command line argument"</li>
</ul></li>

<li>$@ collects up all of the command line arguments.</li>
</ol>

<p>
More rigorous ways exist to name and check command
line arguments. Don't get too committed to the simple
$1 $2 notation.
</p>
</div>
</div>

<div id="outline-container-org461e9bf" class="outline-4">
<h4 id="org461e9bf"><span class="section-number-4">3.2.2</span> Lets make a little test case.</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
<b>mytest.sh</b>
</p>

<pre class="example">
echo "$1"
echo "$2"
echo "OMG here is $1 again"
echo "I'll splat them together $1$2"
</pre>

<p>
I often forget the double-quotes on the arguments.
</p>

<p>
Test that in the command line
</p>

<ol class="org-ol">
<li>No quotes</li>
</ol>

<pre class="example">
sh mytest.sh hellopaul hellobill
</pre>

<ol class="org-ol">
<li>Watch what goes wrong if you have a space in a argument name "hello paul"</li>
</ol>

<pre class="example">
sh mytest.sh hello paul hellobill
</pre>

<ol class="org-ol">
<li>Need to quote the argument to keep the pieces together</li>
</ol>

<pre class="example">
sh mytest.sh "hello paul" hellobill
</pre>
</div>
</div>
</div>
