notes/shell-3.md


<a id="org54deaf2"></a>

## My opinion on where the output should go

-   I strongly prefer to keep the output in a separate output directory.
-   And I would almost certainly put the output directory outside the
    current working directory.

    mkdir ../output

Why do I like that? No danger of disrupting original data.

In fact, I'd make the original data read only like so

    chmod -w N*.txt


<a id="orgbc20d42"></a>

## goostats is a script included with the project.

Our assignment is to run each file through goostats. 


<a id="org7a5b221"></a>

### run goostats once

-   The correct way to process just one file, including 2 parameters
    that professor said we needed.:

    bash goostats  -J 100 -r NENE01729A.txt ../output/NENE01729A-stats.txt

-   Did it work?

    ls ../output

    NENE01729A-stats.txt

-   Lets remove that output folder before we try again

    rm -rf  "../output"


<a id="orgc482bc2"></a>

### For loop: run **over and over**

    $ mkdir ../output
    $ for fn in *[AB].txt
    >    do
    >        bash goostats -J 100 -r "$fn" "../output/stats-$fn"
    > done


<a id="orgd42f6f4"></a>

# Scripts and command line arguments


<a id="org7d9efb9"></a>

## The Big Picture

1.  Test commands that work in the command line
2.  Put those lines into a file
3.  Work out the command line arguments problem
4.  Consider adding "hash-bang" in line 1


<a id="org9be4028"></a>

### Create the text file "dostats.sh".

It looks nicer to write it like this:

    for fn in *[AB].txt
    do
        echo $fn
        bash goostats -J 100 -r "$fn" "output/stats-$fn" 
    done

But it is allowed to use semi-colon to jamb it into one line

    for fn in *[AB].txt; do  echo $fn;  bash goostats -J 100 -r "$fn" "../output/stats-$fn"; done


<a id="orgc47d667"></a>

### Deal with the command line arguments

Now we have the file names hard coded in the script.

Here we use the shortcut "$@" to grab all command line arguments

    ### rm -rf ../output
    mkdir ../output
    for fn in "$@"
    do
    	echo $fn
    	bash goostats -J 100 -r "$fn" "../output/stats-$fn" 
    done


<a id="orgdb431b3"></a>

## Command line arguments

The shell command line arguments can be handled in many ways. The
simple way simply used arguments by their position in the command
line. This is not the best way, since there is no error checking
on the inputs. However, it is commonly used in small projects.


<a id="orgeeec3e1"></a>

### Key Terms

Inside a shell script, these are the simple ways to access command
line arguments.

1.  The dollar sign picks individual arguments
    -   $n means the n'th argument.
    
    -   $1 means "the first command line argument"
    -   $2 means "the second command line argument"

2.  $@ collects up all of the command line arguments.

More rigorous ways exist to name and check command
line arguments. Don't get too committed to the simple
$1 $2 notation.


<a id="orgd411091"></a>

### Lets make a little test case.

**mytest.sh**

    echo "$1"
    echo "$2"
    echo "OMG here is $1 again"
    echo "I'll splat them together $1$2"

I often forget the double-quotes on the arguments.

Test that in the command line

1.  No quotes

    sh mytest.sh hellopaul hellobill

1.  Watch what goes wrong if you have a space in a argument name "hello paul"

    sh mytest.sh hello paul hellobill

1.  Need to quote the argument to keep the pieces together

    sh mytest.sh "hello paul" hellobill
