notes/shell-3.org
** Detour on executable files and "bash" as a program.

Using goostats on a single file, novice might be tempted to run

#+BEGIN_EXAMPLE
goostats infile.txt outfile.txt
#+END_EXAMPLE

   However, we hit problem(s). 
   1. goostats.sh is not executable, and
   1. goostats.sh is not in the path

So we can't run it

   * My natural inclination would be to make goostats executable

#+BEGIN_EXAMPLE
chmod +x goostats.sh
#+END_EXAMPLE

   * and then run with the "./" trick

#+BEGIN_EXAMPLE
./goostats.sh infile.txt outfile.txt
#+END_EXAMPLE

   * however, for security reasons, the system administrators have
     forbidden us from creating new executable files.

   * there is a work-around, however, because even though "goostats"
     is not executable, we are allowed to run the program "bash" and
     it can open goostats and run it for us.


   * `bash` or `sh` or other shells

In the simple cases we are using here, it is virtually certain the 
program would run in a simpler shell than BASH, such as the much more
generic `sh` or the "lightweight" derivatives like `zsh`

#+BEGIN_EXAMPLE
sh goostats.sh
#+END_EXAMPLE

I mention this because on some large multi user systems, the `bash` 
luxury might not be available, while `sh` almost certainly will be.




** Detour about the hash-bang

- If we could make this executable, then running it would not
  guarantee the correct shell is used to run it. We want to make
  sure that `bash` is used, for example.

   We showed above it is possible to launch a program by passing it to
   "bash". That's not unheard of, but it would be somewhat unusual to 
   do this when the work is finished.

- #! is pronounced "hash bang". 

   Often people would insert a line 1 message like this

#+BEGIN_EXAMPLE
#!/bin/bash
#+END_EXAMPLE

- Make the script executable, run

#+BEGIN_EXAMPLE
chmod +x dostats.sh
#+END_EXAMPLE

- If we could make that executable, then we could launch the script

#+BEGIN_EXAMPLE
./handlegoo.sh
#+END_EXAMPLE

- But if we are not allowed to do that the usual Unix say, we run like this

#+BEGIN_EXAMPLE
bash handlegoo.sh
#+END_EXAMPLE

- The "-x" flag activates a debug mode in bash


#+BEGIN_EXAMPLE
bash -x handlegoo.sh
#+END_EXAMPLE
