notes/shell-3.html

<div id="outline-container-orga0107f1" class="outline-3">
<h3 id="orga0107f1"><span class="section-number-3">3.3</span> Detour on executable files and "bash" as a program.</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Using goostats on a single file, novice might be tempted to run
</p>

<pre class="example">
goostats infile.txt outfile.txt
</pre>

<p>
However, we hit problem(s). 
</p>
<ol class="org-ol">
<li>goostats.sh is not executable, and</li>
<li>goostats.sh is not in the path</li>
</ol>

<p>
So we can't run it
</p>

<ul class="org-ul">
<li>My natural inclination would be to make goostats executable</li>
</ul>

<pre class="example">
chmod +x goostats.sh
</pre>

<ul class="org-ul">
<li>and then run with the "./" trick</li>
</ul>

<pre class="example">
./goostats.sh infile.txt outfile.txt
</pre>

<ul class="org-ul">
<li>however, for security reasons, the system administrators have
forbidden us from creating new executable files.</li>

<li>there is a work-around, however, because even though "goostats"
is not executable, we are allowed to run the program "bash" and
it can open goostats and run it for us.</li>
</ul>


<ul class="org-ul">
<li>`bash` or `sh` or other shells</li>
</ul>

<p>
In the simple cases we are using here, it is virtually certain the 
program would run in a simpler shell than BASH, such as the much more
generic `sh` or the "lightweight" derivatives like `zsh`
</p>

<pre class="example">
sh goostats.sh
</pre>

<p>
I mention this because on some large multi user systems, the `bash` 
luxury might not be available, while `sh` almost certainly will be.
</p>
</div>
</div>




<div id="outline-container-org95f6a76" class="outline-3">
<h3 id="org95f6a76"><span class="section-number-3">3.4</span> Detour about the hash-bang</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li><p>
If we could make this executable, then running it would not
guarantee the correct shell is used to run it. We want to make
sure that `bash` is used, for example.
</p>

<p>
We showed above it is possible to launch a program by passing it to
"bash". That's not unheard of, but it would be somewhat unusual to 
do this when the work is finished.
</p></li>

<li><p>
#! is pronounced "hash bang". 
</p>

<p>
Often people would insert a line 1 message like this
</p></li>
</ul>

<pre class="example">
#!/bin/bash
</pre>

<ul class="org-ul">
<li>Make the script executable, run</li>
</ul>

<pre class="example">
chmod +x dostats.sh
</pre>

<ul class="org-ul">
<li>If we could make that executable, then we could launch the script</li>
</ul>

<pre class="example">
./handlegoo.sh
</pre>

<ul class="org-ul">
<li>But if we are not allowed to do that the usual Unix say, we run like this</li>
</ul>

<pre class="example">
bash handlegoo.sh
</pre>

<ul class="org-ul">
<li>The "-x" flag activates a debug mode in bash</li>
</ul>


<pre class="example">
bash -x handlegoo.sh
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-11-13 Sun&gt;</span></span></p>
<p class="author">Author: Paul E. Johnson &lt;pauljohn@ku.edu&gt;</p>
<p class="date">Created: 2016-11-14 Mon 22:46</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
